.artifacts/m3/s25-dev-20260716/wire-rows/profile-load.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  12 secs]  0 threads 25 conns:    22062818 ops, 1841271 (avg: 1838110) ops/sec, 143.80MB/sec (avg: 143.55MB/sec),  0.87 (avg:  0.87) msec latency

4         Threads
25        Connections per thread
12        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.gets   1838083.95         0.00         0.00         0.86862         0.83900         1.68700         2.41500    146991.96 
Totals      1838083.95         0.00         0.00         0.86862         0.83900         1.68700         2.41500    293983.93